import QuestionAccordionBordered from "../../UI/QuestionAccordionBordered";

const CommonQuestions: React.FC = function () {
  const faqItems = [
    {
      question: "منظور از سوپر اپلیکیشن چی هست؟",
      answer:
        "سوپر اپلیکیشن آوا لینگو در واقع یه مرکز جامع و چند منظوره هست که نیازهای مختلف زبانی افراد رو با ارائه سرویس ها و خدمات محتلف به بهترین و کامل ترین شکل ممکن برطرف می کنه. تو سوپر اپلیکیشن آوالینگو دوره ها، محصولات و خدمات متنوع و مختلف آموزشی ارائه میشه که طیف گسترده ای از ویژگی ها و امکانات زبان آموزی رو در بر میگیره.",
    },
    {
      question: "آوا لینگو مناسب چه افرادی هست؟ ",
      answer:
        "خدمات و محصولات آوا لینگو برای افراد علاقمند به زبان های خارجی از سطح مبتدی تا پیشرفته برای سنین 10 تا 80 سال مناسب هستن. این یعنی یک تنوع گسترده و جذاب از نظر محتوا و امکانات آموزشی که تا به حال در این سطح و مقیاس بی سابقه بوده و همین مورد بزرگ ترین نقطه قوت آوا لینگو نسبت به سایر اپلیکیشن های آموزش زبان هست. ",
    },
    {
      question: "آیا نصب آوا لینگو رایگانه؟",
      answer:
        "بله نصب آوا لینگو رایگانه و هیچ هزینه ای نداره. خیلی از بخش ها، دوره ها و محصولات رو می تونی به صورت رایگان و بدون پرداخت هزینه استفاده کنی ولی خب طبیعتا برای بخش های ویژه و دسترسی کامل به همه آموزش ها و خدمات نیاز هست که اشتراک ویژه داشته باشی یا هزینه اون محصول مشخص رو پرداخت کرده باشی. با اینحال کلی محتوای رایگان هم در اختیارت هست که میتونی برای مدت طولانی باهاشون آموزش ببینی و سرگرم باشی.",
    },
    {
      question: "برای نصب آوا لینگو باید چکار کنم؟",
      answer:
        "سوپر اپلیکیشن آوا لینگو روی گوشی های اندرویدی و آیفون قابل استفاده هست. برای نصب نسخه اندروید آوا لینگو می‌تونی نسخه نصبی اون رو به صورت مستقیم از وبسایت آوا لینگو دانلود کنی و روی گوشیت نصبش کنی. برای استفاده روی گوشی های آیفون هم باید از نسخه وب اپ آوا لینگو استفاده کنی.",
    },
  ];
  return (
    <section className="px-5 md:px-16 max-w-298.75 mx-auto pb-15 mt-30 md:mt-0">
      <h2 className="text-2xl md:text-4xl text-black font-light my-5">
        سوالات پرتکرار
      </h2>
      <div className="grid grid-cols-1 md:grid-cols-2 gap-2 md:gap-5">
        <QuestionAccordionBordered items={faqItems} />
      </div>
    </section>
  );
};
export default CommonQuestions;
